---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.Zone.GetDomainData
source: html/7edb0818-7c6a-2bfc-6269-bab9c8baea35.htm
---
# Autodesk.Revit.DB.Mechanical.Zone.GetDomainData Method

Gets the domain data for the zone.

## Syntax (C#)
```csharp
public ZoneElementDomainData GetDomainData()
```

## Returns
Returns a pointer to the base class for specific domain requirements for the zone.